
print('Ввести в консоле')
print('import antigravity')
print('import __hello__')
print('from __future__ import braces')


# Вывести на консоль своё имя, нарисованное 'звёздочками'. Для выполнения этого задания надо использовать не только
# символы звёздочки и пробела, но и ESCAPE символы: \n и \t (Vitalii)
#
#
#
print('hello')
q = '*'
a = '(@)'
print(q+' '*12+q+' '*10+a+' '*12+q*14+' '*10+q*2+' ' *12+q+' '*20+a+' '*10+a+'\t'   
       '\n'+' '*1+q+' '*10+q+' '*12+q+' ' *20+q+' '*14+q+' ' *4+q+' '*10+q+' ' *21+q+' '*12+q+'\t'
      '\n'+' '*2+q+' '*8+q+' '*13+q+' '*20+q+' '*13+q+' '*6+q+' '*9+q+' '*21+q+' ' *12+q+'\t'
      '\n'+' '*3+q+' '*6+q+' '*14+q+' '*20+q+' '*12+q*10+' '*8+q+' '*21+q+' '*12+q+'\t'
      '\n'+' '*4+q+' '*4+q+' ' *15+q+' '*20+q+' '*11+q+' '*10+q+' ' *7+q+' ' *21+q+' ' *12+q+'\t'
      '\n'+' '*5+q+' '*2+q+' '*16+q+' '*20+q+' '*10+q+' '*12+q+' '*6+q+' '*21+q+' ' *12+q+'\t'
      '\n'+ ' '*6+q*2+' '*17+q+' '*20+q+' '*9+q+' '*14+q+' '*5+10*q+' ' *12+q+' '*12+q)


#
#
#
#
# Написать программу, которая выводит в консоль таблицу Escape-последовательностей:


print("Escape sequences:\t"
      "\n \\a  Bell (alert)\t"
      "\n \\b  Backspace\t"
      "\n \\n   New line\t"
      "\n \\t   Horizontal tab \t"
      "\n \\\\   Backslash \\ \t"
      '\n \\"  Double quotation mark" \t'
      "\n \\'   Single quotation mark' ")