a = 4
b = 9



if a + b :
 print ("Код выполняется если выражения истинна True")

else :
  print ("Код Выполняется если выражения истинна False")

# varibale = 123456
#  if '3' in str(varibale):
#        print ("")

# попадает ли число в диапазон от 6 до 356 и пр  этом содержит 7 и 3

# if 6 < variable < 356 and '7' in str(variable) and '3' in str(variable):
#     print('Все совпало')
# else:
#     print("Чего то не хватает")



# опрелелить суму покупки в зависимости от скидки
##  до 500 грн - без скидки
## от 500 до 1000 - 5%
## от 1000 - 8%


price = float(input())